Revit 2024 API
BuiltInFailures.StairRampFailures.UnexpectedCurveIntersectionFailure Property
 Computing curve intersection and find the invalid result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnexpectedCurveIntersectionFailure { get; }
Visual Basic
Public Shared ReadOnly Property UnexpectedCurveIntersectionFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnexpectedCurveIntersectionFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace